ErpTest/src/DataProcessors/пкПроверкаЗаданийНаПеревозку/пкПроверкаЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пкПроверкаЗаданийНаПеревозку</name>
  <comment>Рарус</comment>
</mdclass:DataProcessor>

ErpTest/src/Documents/пкПогрузкаВыгрузкаПоДоставке/пкПогрузкаВыгрузкаПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкПогрузкаВыгрузкаПоДоставке</name>
  <comment>Погрузка/выгрузка техники по Доставке</comment>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкСостояниеТехники</registerRecords>
  <registerRecords>InformationRegister.пкСтатусыРемонтаТехники</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.пкОперацииПогрузкаВыгрузка</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательМП</name>
    <type>
      <types>CatalogRef.пкПользователиМП</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/Documents/пкЗаданиеНаПеревозку/пкЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаПеревозку</name>
  <basedOn>Catalog.ОбъектыЭксплуатации</basedOn>
  <basedOn>Document.пкЗаданиеНаПеревозку</basedOn>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкТехникаКПеремещениюМеждуРегионами</registerRecords>
  <registerRecords>InformationRegister.пкДатыАренды</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗаказНарядНаОсмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеПодтверждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПодтвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КПроверке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийВодителю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/DataProcessors/пкПроверкаЗаданийНаПеревозку/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ТекущийПользователь = Пользователи.ТекущийПользователь();
    
    ОтборПодразделение = ТекущийПользователь.Подразделение;
    
    Если НЕ ЗначениеЗаполнено(ОтборПодразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", , , , Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", ОтборПодразделение, , , Истина);
    КонецЕСли;        
    
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
    
    Если НЕ ЗначениеЗаполнено(ОтборПодразделение) Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", , , , Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		    ЗаданияКПроверке, "Подразделение", ОтборПодразделение, , , Истина);
    КонецЕСли;        

КонецПроцедуры

&НаСервере
Процедура ИсправитьНаСервере(ЗаданиеНаПеревозку, ЗаявкаНаАрендуТехники)
    
    ЗаданиеНаПеревозкуОбъект = ЗаданиеНаПеревозку.ПолучитьОбъект();
    ЗаданиеНаПеревозкуОбъект.ЗаявкаНаАрендуТехники = ЗаявкаНаАрендуТехники;
    
    Попытка
        ЗаданиеНаПеревозкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
    Исключение
        ЗаданиеНаПеревозкуОбъект.КПроверке = Истина;
        ЗаданиеНаПеревозкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
    КонецПопытки;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	пкПогрузкаВыгрузкаПоДоставке.Ссылка
    |ИЗ
    |	Документ.пкПогрузкаВыгрузкаПоДоставке КАК пкПогрузкаВыгрузкаПоДоставке
    |ГДЕ
    |	пкПогрузкаВыгрузкаПоДоставке.Проведен
    |	И пкПогрузкаВыгрузкаПоДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку";
    
    Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        ПогрузкаВыгрузкаПоДоставке = Выборка.Ссылка.ПолучитьОбъект();
        
        Попытка
        	ПогрузкаВыгрузкаПоДоставке.Записать(РежимЗаписиДокумента.Проведение);
        Исключение
        КонецПопытки;
    КонецЦикла;
    
    Элементы.ЗаданияКПроверке.Обновить();
    
КонецПроцедуры

&НаСервере
Процедура ПровестиЗаданиеНаСервере(ЗаданиеНаПеревозку)
    
    ЗаданиеНаПеревозкуОбъект = ЗаданиеНаПеревозку.ПолучитьОбъект();
    
    Попытка
        ЗаданиеНаПеревозкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
    Исключение
    КонецПопытки;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	пкПогрузкаВыгрузкаПоДоставке.Ссылка
    |ИЗ
    |	Документ.пкПогрузкаВыгрузкаПоДоставке КАК пкПогрузкаВыгрузкаПоДоставке
    |ГДЕ
    |	пкПогрузкаВыгрузкаПоДоставке.Проведен
    |	И пкПогрузкаВыгрузкаПоДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку";
    
    Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        ПогрузкаВыгрузкаПоДоставке = Выборка.Ссылка.ПолучитьОбъект();
        
        Попытка
        	ПогрузкаВыгрузкаПоДоставке.Записать(РежимЗаписиДокумента.Проведение);
        Исключение
        КонецПопытки;
    КонецЦикла;
    
    Элементы.ЗаданияКПроверке.Обновить();
    
КонецПроцедуры    

&НаКлиенте
Процедура Исправить(Команда)
    
    ТекущиеДанные = Элементы.ЗаданияКПроверке.ТекущиеДанные;
    
    Если ТекущиеДанные <> Неопределено Тогда
        Если ТекущиеДанные.ЗаменаЗаявки И ЗначениеЗаполнено(ТекущиеДанные.ЗаявкаНаАрендуТехникиДляЗамены) Тогда
            ИсправитьНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.ЗаявкаНаАрендуТехникиДляЗамены);
        ИначеЕсли НЕ ТекущиеДанные.ЗаменаЗаявки Тогда
            ПровестиЗаданиеНаСервере(ТекущиеДанные.Ссылка);
        КонецЕсли;
    КонецЕсли;    
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияКПроверкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    ТекущиеДанные = Элементы.ЗаданияКПроверке.ТекущиеДанные;
    
    Если ТекущиеДанные <> Неопределено Тогда
        Если Поле.Имя = "ЗаданияКПроверкеТекущаяЗаявкаНаАрендуТехники" Тогда
            Отбор = Новый Структура();
            Отбор.Вставить("Ключ", ТекущиеДанные.ТекущаяЗаявкаНаАрендуТехники);
            
            ОткрытьФорму("Документ.пкЗаявкаНаАрендуТехники.Форма.ФормаДокумента", Отбор, ЭтаФорма);
            
        ИначеЕсли Поле.Имя = "ЗаданияКПроверкеЗаявкаНаАрендуТехникиДляЗамены" Тогда
            Отбор = Новый Структура();
            Отбор.Вставить("Ключ", ТекущиеДанные.ЗаявкаНаАрендуТехникиДляЗамены);
            
            ОткрытьФорму("Документ.пкЗаявкаНаАрендуТехники.Форма.ФормаДокумента", Отбор, ЭтаФорма);
            
        Иначе
            Отбор = Новый Структура();
            Отбор.Вставить("Ключ", ТекущиеДанные.Ссылка);
            
            ОткрытьФорму("Документ.пкЗаданиеНаПеревозку.Форма.ФормаДокумента", Отбор, ЭтаФорма);
        КонецЕсли; 
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    
    Элементы.ЗаданияКПроверке.Обновить();
    
КонецПроцедуры
